Repository: JeswanthM26/Flutter_base_Project
Catalog: lib/l10n/app_*.arb
Languages: te

# appBarTitle
source: ApzInputField Preview
te: ApzInputField ప్రివ్యూ

source: Label
te: లేబుల్

source: Placeholder
te: ప్లేస్‌హోల్డర్

# textDescription
source: This is a text description to provide more information.
te: మరింత సమాచారం అందించడానికి ఇది టెక్స్ట్ ವಿವರಣೆ.

source: Enter 4-Digit OTP
te: 4-అంకెల OTPని నమోదు చేయండి

source: Enter 6-Digit OTP
te: 6-అంకెల OTPని నమోదు చేయండి

source: Amount
te: మొత్తం

source: Products (API)
te: ఉత్పత్తులు (API)

source: Products (Mock)
te: ఉత్పత్తులు (మాక్)

# deleteProductTitle
source: Delete Product?
te: ఉత్పత్తిని తొలగించాలా?

# deleteProductContent
source: Are you sure you want to delete '{productTitle}'?
te: '{productTitle}'ని తొలగించాలని మీరు ఖచ్చితంగా అనుకుంటున్నారా?

source: Cancel
te: రద్దు చేయి

source: Delete
te: తొలగించు

source: Edit Product
te: ఉత్పత్తిని సవరించు

source: Create Product
te: ఉత్పత్తిని సృష్టించు

source: Title
te: శీర్షిక

source: Title is required
te: శీర్షిక అవసరం

source: Price
te: ధర

source: Price is required
te: ధర అవసరం

source: Enter a valid price
te: దయచేసి సరైన ధరను నమోదు చేయండి

source: Description
te: వివరణ

source: Description is required
te: వివరణ అవసరం

source: Save
te: సేవ్ చేయి

# noProductsFound
source: No products found. Add one!
te: ఉత్పత్తులు కనుగొనబడలేదు. ఒకటి జోడించండి!

# anErrorOccurred
source: An error occurred: {error}
te: ఒక లోపం సంభవించింది: {error}
